#"1st program"
print(9 ** 0.5 * 5) # Просто умножаем
#"2st program"
print(99.9 > 99.8 and 1000 != 1000.1) # Сравниваем логические выражения через and-уточнение.
#"3st program"
print( 2 * 2 + 2)  #сначала умножение потом сложение
print(2* (2 + 2)) #Сначала слодение в скобочках потом умножение
print(6 == 8) # False- не правда 6 не равно 8.
#"4st program"
print('123.456') #Дано по заданию
print(float('123.456')) #Переводим из строки в число
print(123.456 * 10) # Дробное число умножаем на 10
print(int(1234.56)) # Переводим дробное число в целое
print(1234 / 10) # Делим целое число на 10 и получаем ответ с одной цифрой после символа точки.

#Старая версия практического задания.
#'1st program'
print(9 ** 0.5 * 5)
#"2st program"
print(99.9 > 99.8 or 1000 != 1000.1) # Сравниваем логические выражения через or-или.
#"3st program"
print(1234,5678)
print(1234 % 1000)
print(234 // 10)
print(5678 % 1000)
print(678 // 10)
print( 23 + 67)
#"4st program"
print(13.42, 42.13 )
print(int(13.42)) # Выводим целое число и освобождаемся от дроби.
print(int(42.13)) # Убираем целое цисло что бы узнать дробную часть цисла.
print( 13 == 13)